<pad>
<unk>
<s>
</s>
<0x00>
<0x01>
<0x02>
<0x03>
<0x04>
<0x05>
<0x06>
<0x07>
<0x08>
<0x09>
<0x0A>
<0x0B>
<0x0C>
<0x0D>
<0x0E>
<0x0F>
<0x10>
<0x11>
<0x12>
<0x13>
<0x14>
<0x15>
<0x16>
<0x17>
<0x18>
<0x19>
<0x1A>
<0x1B>
<0x1C>
<0x1D>
<0x1E>
<0x1F>
<0x20>
<0x21>
<0x22>
<0x23>
<0x24>
<0x25>
<0x26>
<0x27>
<0x28>
<0x29>
<0x2A>
<0x2B>
<0x2C>
<0x2D>
<0x2E>
<0x2F>
<0x30>
<0x31>
<0x32>
<0x33>
<0x34>
<0x35>
<0x36>
<0x37>
<0x38>
<0x39>
<0x3A>
<0x3B>
<0x3C>
<0x3D>
<0x3E>
<0x3F>
<0x40>
<0x41>
<0x42>
<0x43>
<0x44>
<0x45>
<0x46>
<0x47>
<0x48>
<0x49>
<0x4A>
<0x4B>
<0x4C>
<0x4D>
<0x4E>
<0x4F>
<0x50>
<0x51>
<0x52>
<0x53>
<0x54>
<0x55>
<0x56>
<0x57>
<0x58>
<0x59>
<0x5A>
<0x5B>
<0x5C>
<0x5D>
<0x5E>
<0x5F>
<0x60>
<0x61>
<0x62>
<0x63>
<0x64>
<0x65>
<0x66>
<0x67>
<0x68>
<0x69>
<0x6A>
<0x6B>
<0x6C>
<0x6D>
<0x6E>
<0x6F>
<0x70>
<0x71>
<0x72>
<0x73>
<0x74>
<0x75>
<0x76>
<0x77>
<0x78>
<0x79>
<0x7A>
<0x7B>
<0x7C>
<0x7D>
<0x7E>
<0x7F>
<0x80>
<0x81>
<0x82>
<0x83>
<0x84>
<0x85>
<0x86>
<0x87>
<0x88>
<0x89>
<0x8A>
<0x8B>
<0x8C>
<0x8D>
<0x8E>
<0x8F>
<0x90>
<0x91>
<0x92>
<0x93>
<0x94>
<0x95>
<0x96>
<0x97>
<0x98>
<0x99>
<0x9A>
<0x9B>
<0x9C>
<0x9D>
<0x9E>
<0x9F>
<0xA0>
<0xA1>
<0xA2>
<0xA3>
<0xA4>
<0xA5>
<0xA6>
<0xA7>
<0xA8>
<0xA9>
<0xAA>
<0xAB>
<0xAC>
<0xAD>
<0xAE>
<0xAF>
<0xB0>
<0xB1>
<0xB2>
<0xB3>
<0xB4>
<0xB5>
<0xB6>
<0xB7>
<0xB8>
<0xB9>
<0xBA>
<0xBB>
<0xBC>
<0xBD>
<0xBE>
<0xBF>
<0xC0>
<0xC1>
<0xC2>
<0xC3>
<0xC4>
<0xC5>
<0xC6>
<0xC7>
<0xC8>
<0xC9>
<0xCA>
<0xCB>
<0xCC>
<0xCD>
<0xCE>
<0xCF>
<0xD0>
<0xD1>
<0xD2>
<0xD3>
<0xD4>
<0xD5>
<0xD6>
<0xD7>
<0xD8>
<0xD9>
<0xDA>
<0xDB>
<0xDC>
<0xDD>
<0xDE>
<0xDF>
<0xE0>
<0xE1>
<0xE2>
<0xE3>
<0xE4>
<0xE5>
<0xE6>
<0xE7>
<0xE8>
<0xE9>
<0xEA>
<0xEB>
<0xEC>
<0xED>
<0xEE>
<0xEF>
<0xF0>
<0xF1>
<0xF2>
<0xF3>
<0xF4>
<0xF5>
<0xF6>
<0xF7>
<0xF8>
<0xF9>
<0xFA>
<0xFB>
<0xFC>
<0xFD>
<0xFE>
<0xFF>
a
‚ĖĀa
b
‚ĖĀb
c
‚ĖĀc
d
‚ĖĀd
e
‚ĖĀe
f
‚ĖĀf
g
‚ĖĀg
h
‚ĖĀh
i
‚ĖĀi
j
‚ĖĀj
k
‚ĖĀk
l
‚ĖĀl
m
‚ĖĀm
n
‚ĖĀn
o
‚ĖĀo
p
‚ĖĀp
q
‚ĖĀq
r
‚ĖĀr
s
‚ĖĀs
t
‚ĖĀt
u
‚ĖĀu
v
‚ĖĀv
w
‚ĖĀw
x
‚ĖĀx
y
‚ĖĀy
z
‚ĖĀz
.
,
!
?
;
:
'
"
-
(
)
[
]
{
}
/
<
>
@
#
$
%
^
&
*
+
=
|
~
`
\
A
‚ĖĀA
B
‚ĖĀB
C
‚ĖĀC
D
‚ĖĀD
E
‚ĖĀE
F
‚ĖĀF
G
‚ĖĀG
H
‚ĖĀH
I
‚ĖĀI
J
‚ĖĀJ
K
‚ĖĀK
L
‚ĖĀL
M
‚ĖĀM
N
‚ĖĀN
O
‚ĖĀO
P
‚ĖĀP
Q
‚ĖĀQ
R
‚ĖĀR
S
‚ĖĀS
T
‚ĖĀT
U
‚ĖĀU
V
‚ĖĀV
W
‚ĖĀW
X
‚ĖĀX
Y
‚ĖĀY
Z
‚ĖĀZ
==
!=
<=
>=
->
=>
::
..
...
&&
||
<<
>>
+=
-=
*=
/=
**
++
--
:=
===
!==
?.
??
|>
<-
|=
&=
^=
%=
<>
~=
‚ā¨
¬£
¬•
¬Ę
0
1
2
3
4
5
6
7
8
9
őĪ
‚ĖĀőĪ
ő≤
‚ĖĀő≤
ő≥
‚ĖĀő≥
őī
‚ĖĀőī
őĶ
‚ĖĀőĶ
ő∂
‚ĖĀő∂
ő∑
‚ĖĀő∑
őł
‚ĖĀőł
őĻ
‚ĖĀőĻ
őļ
‚ĖĀőļ
őĽ
‚ĖĀőĽ
őľ
‚ĖĀőľ
őĹ
‚ĖĀőĹ
őĺ
‚ĖĀőĺ
ŌÄ
‚ĖĀŌÄ
ŌĀ
‚ĖĀŌĀ
ŌÉ
‚ĖĀŌÉ
ŌĄ
‚ĖĀŌĄ
ŌÖ
‚ĖĀŌÖ
ŌÜ
‚ĖĀŌÜ
Ōá
‚ĖĀŌá
Ōą
‚ĖĀŌą
ŌČ
‚ĖĀŌČ
őĎ
‚ĖĀőĎ
őí
‚ĖĀőí
őď
‚ĖĀőď
őĒ
‚ĖĀőĒ
őē
‚ĖĀőē
őĖ
‚ĖĀőĖ
őó
‚ĖĀőó
őė
‚ĖĀőė
őô
‚ĖĀőô
őö
‚ĖĀőö
őõ
‚ĖĀőõ
őú
‚ĖĀőú
őĚ
‚ĖĀőĚ
őě
‚ĖĀőě
ő†
‚ĖĀő†
ő°
‚ĖĀő°
ő£
‚ĖĀő£
ő§
‚ĖĀő§
ő•
‚ĖĀő•
ő¶
‚ĖĀő¶
őß
‚ĖĀőß
ő®
‚ĖĀő®
ő©
‚ĖĀő©
¬ß
¬∂
¬©
¬ģ
‚ĄĘ
‚Üí
‚Üź
‚ÜĎ
‚Üď
‚ÜĒ
‚Üē
‚áź
‚áí
‚áĎ
‚áď
‚áĒ
‚áē
‚Ü¶
‚Ü§
‚Üß
‚Ü•
‚áč
‚áĆ
‚áÄ
‚áĀ
‚Üľ
‚ÜĹ
‚Üö
‚Üõ
‚ü∂
‚üĶ
‚ü∑
‚üĻ
‚üł
‚üļ
‚§Ė
‚§ē
‚üŅ
‚ÜĮ
¬Ĺ
¬ľ
¬ĺ
‚Öď
‚ÖĒ
‚Öē
‚ÖĖ
‚Öó
‚Öė
‚Öô
‚Öö
‚Öõ
‚Öú
‚ÖĚ
‚Öě
‚Öź
‚ÖĎ
‚Öí
‚Öü
‚ąß
‚ą®
¬¨
‚äē
‚äĽ
‚äľ
‚äĹ
‚ąī
‚ąĶ
‚äĘ
‚ä£
‚ä®
‚ä≠
‚ä§
‚ä•
‚üā
‚ÄĖ
‚ąĎ
‚ąŹ
‚ąź
‚ąę
‚ą¨
‚ą≠
‚ąģ
‚ąĮ
‚ąį
‚ąā
‚ąá
‚ąö
‚ąõ
‚ąú
‚ąě
‚ąĚ
‚ąÖ
‚ąÄ
‚ąÉ
‚ąĄ
¬Ī
‚ąď
‚ąó
‚ąė
‚ąô
‚čÖ
√ó
√∑
‚®Į
‚®Ā
‚®ā
‚äĖ
‚äó
‚äė
‚äô
‚äö
‚äõ
‚ąĒ
‚ął
‚Čą
‚ČÉ
‚ČÖ
‚Č°
‚Č†
‚Č§
‚Č•
‚Č™
‚Čę
‚Čļ
‚ČĽ
‚Čľ
‚ČĹ
‚äā
‚äÉ
‚äĄ
‚äÖ
‚äÜ
‚äá
‚ää
‚äč
‚ąą
‚ąČ
‚ąč
‚ąĆ
‚Čü
‚ČĚ
‚Čú
‚Čź
‚ąľ
‚ąĹ
‚äŹ
‚äź
‚äĎ
‚äí
‚Č≤
‚Č≥
‚čĖ
‚čó
‚™Į
‚™į
‚ą™
‚ą©
‚ąĖ
‚äé
‚®Ą
‚®Ü
‚®Ö
‚®ą
‚®Č
‚Ąē
‚ĖĀ‚Ąē
‚Ą§
‚ĖĀ‚Ą§
‚Ąö
‚ĖĀ‚Ąö
‚ĄĚ
‚ĖĀ‚ĄĚ
‚Ąā
‚ĖĀ‚Ąā
‚Ąć
‚ĖĀ‚Ąć
‚Ąô
‚ĖĀ‚Ąô
ūĚĒĹ
‚ĖĀūĚĒĹ
‚ĖĀ
¬≤
¬≥
‚Āī
the
‚ĖĀthe
an
‚ĖĀan
of
‚ĖĀof
to
‚ĖĀto
in
‚ĖĀin
on
‚ĖĀon
at
‚ĖĀat
by
‚ĖĀby
for
‚ĖĀfor
with
‚ĖĀwith
from
‚ĖĀfrom
as
‚ĖĀas
is
‚ĖĀis
was
‚ĖĀwas
are
‚ĖĀare
were
‚ĖĀwere
be
‚ĖĀbe
been
‚ĖĀbeen
being
‚ĖĀbeing
have
‚ĖĀhave
has
‚ĖĀhas
had
‚ĖĀhad
do
‚ĖĀdo
does
‚ĖĀdoes
did
‚ĖĀdid
will
‚ĖĀwill
would
‚ĖĀwould
can
‚ĖĀcan
could
‚ĖĀcould
should
‚ĖĀshould
may
‚ĖĀmay
might
‚ĖĀmight
must
‚ĖĀmust
shall
‚ĖĀshall
upon
‚ĖĀupon
into
‚ĖĀinto
onto
‚ĖĀonto
over
‚ĖĀover
under
‚ĖĀunder
above
‚ĖĀabove
below
‚ĖĀbelow
between
‚ĖĀbetween
through
‚ĖĀthrough
during
‚ĖĀduring
before
‚ĖĀbefore
after
‚ĖĀafter
since
‚ĖĀsince
until
‚ĖĀuntil
while
‚ĖĀwhile
because
‚ĖĀbecause
although
‚ĖĀalthough
though
‚ĖĀthough
if
‚ĖĀif
unless
‚ĖĀunless
whether
‚ĖĀwhether
when
‚ĖĀwhen
where
‚ĖĀwhere
why
‚ĖĀwhy
how
‚ĖĀhow
what
‚ĖĀwhat
which
‚ĖĀwhich
who
‚ĖĀwho
whom
‚ĖĀwhom
whose
‚ĖĀwhose
that
‚ĖĀthat
this
‚ĖĀthis
these
‚ĖĀthese
those
‚ĖĀthose
and
‚ĖĀand
or
‚ĖĀor
but
‚ĖĀbut
nor
‚ĖĀnor
so
‚ĖĀso
yet
‚ĖĀyet
also
‚ĖĀalso
not
‚ĖĀnot
no
‚ĖĀno
very
‚ĖĀvery
just
‚ĖĀjust
only
‚ĖĀonly
even
‚ĖĀeven
more
‚ĖĀmore
most
‚ĖĀmost
some
‚ĖĀsome
any
‚ĖĀany
all
‚ĖĀall
each
‚ĖĀeach
every
‚ĖĀevery
both
‚ĖĀboth
few
‚ĖĀfew
many
‚ĖĀmany
much
‚ĖĀmuch
other
‚ĖĀother
another
‚ĖĀanother
same
‚ĖĀsame
such
‚ĖĀsuch
he
‚ĖĀhe
she
‚ĖĀshe
it
‚ĖĀit
we
‚ĖĀwe
they
‚ĖĀthey
you
‚ĖĀyou
me
‚ĖĀme
him
‚ĖĀhim
her
‚ĖĀher
us
‚ĖĀus
them
‚ĖĀthem
my
‚ĖĀmy
your
‚ĖĀyour
his
‚ĖĀhis
its
‚ĖĀits
our
‚ĖĀour
their
‚ĖĀtheir
mine
‚ĖĀmine
yours
‚ĖĀyours
hers
‚ĖĀhers
ours
‚ĖĀours
theirs
‚ĖĀtheirs
un
‚ĖĀun
im
‚ĖĀim
ir
‚ĖĀir
il
‚ĖĀil
dis
‚ĖĀdis
non
‚ĖĀnon
mis
‚ĖĀmis
de
‚ĖĀde
pre
‚ĖĀpre
post
‚ĖĀpost
anti
‚ĖĀanti
auto
‚ĖĀauto
bi
‚ĖĀbi
co
‚ĖĀco
counter
‚ĖĀcounter
en
‚ĖĀen
ex
‚ĖĀex
extra
‚ĖĀextra
fore
‚ĖĀfore
inter
‚ĖĀinter
intra
‚ĖĀintra
mid
‚ĖĀmid
out
‚ĖĀout
re
‚ĖĀre
semi
‚ĖĀsemi
sub
‚ĖĀsub
super
‚ĖĀsuper
trans
‚ĖĀtrans
tri
‚ĖĀtri
ultra
‚ĖĀultra
up
‚ĖĀup
photo
‚ĖĀphoto
bio
‚ĖĀbio
geo
‚ĖĀgeo
hydro
‚ĖĀhydro
electro
‚ĖĀelectro
micro
‚ĖĀmicro
macro
‚ĖĀmacro
mono
‚ĖĀmono
multi
‚ĖĀmulti
neo
‚ĖĀneo
para
‚ĖĀpara
poly
‚ĖĀpoly
proto
‚ĖĀproto
pseudo
‚ĖĀpseudo
quasi
‚ĖĀquasi
retro
‚ĖĀretro
tele
‚ĖĀtele
thermo
‚ĖĀthermo
neuro
‚ĖĀneuro
cardio
‚ĖĀcardio
paleo
‚ĖĀpaleo
archaeo
‚ĖĀarchaeo
astro
‚ĖĀastro
chrono
‚ĖĀchrono
crypto
‚ĖĀcrypto
infra
‚ĖĀinfra
tion
‚ĖĀtion
sion
‚ĖĀsion
ment
‚ĖĀment
ness
‚ĖĀness
ity
‚ĖĀity
ence
‚ĖĀence
ance
‚ĖĀance
ism
‚ĖĀism
ist
‚ĖĀist
er
‚ĖĀer
ar
‚ĖĀar
able
‚ĖĀable
ible
‚ĖĀible
ful
‚ĖĀful
less
‚ĖĀless
ous
‚ĖĀous
ive
‚ĖĀive
al
‚ĖĀal
ial
‚ĖĀial
ic
‚ĖĀic
ical
‚ĖĀical
ish
‚ĖĀish
like
‚ĖĀlike
ly
‚ĖĀly
ify
‚ĖĀify
ise
‚ĖĀise
ize
‚ĖĀize
ate
‚ĖĀate
ology
‚ĖĀology
graph
‚ĖĀgraph
graphy
‚ĖĀgraphy
scope
‚ĖĀscope
meter
‚ĖĀmeter
metry
‚ĖĀmetry
lysis
‚ĖĀlysis
synthesis
‚ĖĀsynthesis
phyte
‚ĖĀphyte
cyte
‚ĖĀcyte
genic
‚ĖĀgenic
ing
‚ĖĀing
ed
‚ĖĀed
es
‚ĖĀes
est
‚ĖĀest
BEGIN
‚ĖĀBEGIN
END
‚ĖĀEND
FALSE
‚ĖĀFALSE
False
‚ĖĀFalse
NULL
‚ĖĀNULL
None
‚ĖĀNone
Protocol
‚ĖĀProtocol
TRUE
‚ĖĀTRUE
True
‚ĖĀTrue
Type
‚ĖĀType
_
_Generic
__based
__declspec
__except
__extension__
__finally
__future__
__leave
__try
_abstract_declarator
_additive_operator
_arg
_argument
_arrow_operator
_as
_attribute_argument
_await_operator
_binary_star_star
_block
_call_operator
_call_signature
_class_declaration
_class_name
_collection_elements
_comparison_operator
_compound_statement
_condition
_constrained_type
_declarator
_directive_elseif
_directive_if
_dot
_element_value
_else_options
_equal_sign
_equality_operator
_expression
_expressions
_f_expression
_field_declarator
_field_identifier
_find_pattern_body
_fold_operator
_for_header
_for_range_loop_body
_for_statement_body
_formal_parameter
_from_clause
_hash_pattern_body
_hash_symbol
_immediate_quest
_import_identifier
_import_list
_indent
_initializer
_int_or_float
_is_operator
_jsx_attribute_value
_jsx_element_name
_jsx_identifier
_key_path_component
_lambda_capture
_left_hand_side
_let_chain
_lhs
_lhs_expression
_line_doc_content
_literal
_literal_pattern
_local_statement
_macro_head
_match_block
_method_declarator
_method_name
_method_rest
_mlhs
_module
_module_export_name
_name
_newline
_nonlocal_variable
_package_identifier
_parameter_name
_path
_pattern
_pattern_constant
_pattern_expr
_pattern_expr_basic
_pattern_primitive
_pow
_preproc_expression
_primary
_property_name
_quest
_range_operator
_right_hand_side
_semi
_semicolon
_short_interpolation
_simple_numeric
_simple_pattern
_simple_statement
_simple_type
_simple_user_type
_statement
_statements
_string
_suite
_terminator
_ternary_qmark
_three_dot_operator
_top_level_statement
_tuple_pattern_item
_tuple_type_member
_type
_type_declarator
_type_identifier
_type_switch_header
_unannotated_type
_unary_minus_num
_use_clause
_variable
abstract
‚ĖĀabstract
abstract_type
‚ĖĀabstract_type
access_specifier
‚ĖĀaccess_specifier
accessor
‚ĖĀaccessor
actor
‚ĖĀactor
additive_expression
‚ĖĀadditive_expression
alias
‚ĖĀalias
alias_declaration
‚ĖĀalias_declaration
aliased_import
‚ĖĀaliased_import
alignas
‚ĖĀalignas
alignas_qualifier
‚ĖĀalignas_qualifier
alignof
‚ĖĀalignof
alignof_expression
‚ĖĀalignof_expression
alternative_pattern
‚ĖĀalternative_pattern
ambient_declaration
‚ĖĀambient_declaration
and_eq
‚ĖĀand_eq
annotated_type
‚ĖĀannotated_type
annotation
‚ĖĀannotation
annotation_type_body
‚ĖĀannotation_type_body
arch
‚ĖĀarch
argument_list
‚ĖĀargument_list
arguments
‚ĖĀarguments
array
‚ĖĀarray
array_access
‚ĖĀarray_access
array_declarator
‚ĖĀarray_declarator
array_expression
‚ĖĀarray_expression
array_initializer
‚ĖĀarray_initializer
array_literal
‚ĖĀarray_literal
array_pattern
‚ĖĀarray_pattern
array_type
‚ĖĀarray_type
arrow_function
‚ĖĀarrow_function
as_expression
‚ĖĀas_expression
as_operator
‚ĖĀas_operator
as_pattern
‚ĖĀas_pattern
as_pattern_target
‚ĖĀas_pattern_target
asm
‚ĖĀasm
assert
‚ĖĀassert
assert_statement
‚ĖĀassert_statement
asserts
‚ĖĀasserts
asserts_annotation
‚ĖĀasserts_annotation
assignment
‚ĖĀassignment
assignment_pattern
‚ĖĀassignment_pattern
assignment_statement
‚ĖĀassignment_statement
associated_type
‚ĖĀassociated_type
associatedtype
‚ĖĀassociatedtype
asterisk
‚ĖĀasterisk
async
‚ĖĀasync
async_block
‚ĖĀasync_block
attribute
‚ĖĀattribute
attribute_item
‚ĖĀattribute_item
attribute_specifier
‚ĖĀattribute_specifier
attributed_statement
‚ĖĀattributed_statement
augmented_assignment
‚ĖĀaugmented_assignment
available
‚ĖĀavailable
await
‚ĖĀawait
await_expression
‚ĖĀawait_expression
bang
‚ĖĀbang
bare_string
‚ĖĀbare_string
bare_symbol
‚ĖĀbare_symbol
base_class_clause
‚ĖĀbase_class_clause
begin
‚ĖĀbegin
begin_block
‚ĖĀbegin_block
bin_literal
‚ĖĀbin_literal
binary
‚ĖĀbinary
binary_expression
‚ĖĀbinary_expression
binary_operator
‚ĖĀbinary_operator
bitand
‚ĖĀbitand
bitfield_clause
‚ĖĀbitfield_clause
bitor
‚ĖĀbitor
bitwise_operation
‚ĖĀbitwise_operation
blank_identifier
‚ĖĀblank_identifier
block
‚ĖĀblock
block_argument
‚ĖĀblock_argument
block_body
‚ĖĀblock_body
block_parameter
‚ĖĀblock_parameter
block_parameters
‚ĖĀblock_parameters
body_statement
‚ĖĀbody_statement
bool
‚ĖĀbool
boolean
‚ĖĀboolean
boolean_literal
‚ĖĀboolean_literal
boolean_operator
‚ĖĀboolean_operator
boolean_type
‚ĖĀboolean_type
bounded_type
‚ĖĀbounded_type
bracketed_type
‚ĖĀbracketed_type
break
‚ĖĀbreak
break_command
‚ĖĀbreak_command
break_expression
‚ĖĀbreak_expression
break_statement
‚ĖĀbreak_statement
byte
‚ĖĀbyte
call
‚ĖĀcall
call_expression
‚ĖĀcall_expression
call_signature
‚ĖĀcall_signature
call_suffix
‚ĖĀcall_suffix
canImport
‚ĖĀcanImport
capture_list
‚ĖĀcapture_list
capture_list_item
‚ĖĀcapture_list_item
captured_pattern
‚ĖĀcaptured_pattern
case
‚ĖĀcase
case_clause
‚ĖĀcase_clause
case_match
‚ĖĀcase_match
case_pattern
‚ĖĀcase_pattern
case_statement
‚ĖĀcase_statement
cast_expression
‚ĖĀcast_expression
catch
‚ĖĀcatch
catch_block
‚ĖĀcatch_block
catch_clause
‚ĖĀcatch_clause
catch_keyword
‚ĖĀcatch_keyword
catch_type
‚ĖĀcatch_type
chained_string
‚ĖĀchained_string
chan
‚ĖĀchan
channel_type
‚ĖĀchannel_type
char
‚ĖĀchar
char_literal
‚ĖĀchar_literal
character
‚ĖĀcharacter
character_literal
‚ĖĀcharacter_literal
check_expression
‚ĖĀcheck_expression
chevron
‚ĖĀchevron
class
‚ĖĀclass
class_body
‚ĖĀclass_body
class_declaration
‚ĖĀclass_declaration
class_definition
‚ĖĀclass_definition
class_heritage
‚ĖĀclass_heritage
class_literal
‚ĖĀclass_literal
class_pattern
‚ĖĀclass_pattern
class_specifier
‚ĖĀclass_specifier
class_static_block
‚ĖĀclass_static_block
class_variable
‚ĖĀclass_variable
closure_expression
‚ĖĀclosure_expression
closure_parameters
‚ĖĀclosure_parameters
co_await
‚ĖĀco_await
co_await_expression
‚ĖĀco_await_expression
co_return_statement
‚ĖĀco_return_statement
co_yield
‚ĖĀco_yield
co_yield_statement
‚ĖĀco_yield_statement
colorLiteral
‚ĖĀcolorLiteral
column
‚ĖĀcolumn
comma_expression
‚ĖĀcomma_expression
command_binary
‚ĖĀcommand_binary
command_unary
‚ĖĀcommand_unary
communication_case
‚ĖĀcommunication_case
comparison_operator
‚ĖĀcomparison_operator
compiler
‚ĖĀcompiler
compl
‚ĖĀcompl
complex
‚ĖĀcomplex
complex_pattern
‚ĖĀcomplex_pattern
composite_literal
‚ĖĀcomposite_literal
compound_requirement
‚ĖĀcompound_requirement
compound_statement
‚ĖĀcompound_statement
computed_getter
‚ĖĀcomputed_getter
computed_modify
‚ĖĀcomputed_modify
computed_property
‚ĖĀcomputed_property
computed_setter
‚ĖĀcomputed_setter
concatenated_string
‚ĖĀconcatenated_string
concept
‚ĖĀconcept
concept_definition
‚ĖĀconcept_definition
condition_clause
‚ĖĀcondition_clause
conditional
‚ĖĀconditional
conditional_type
‚ĖĀconditional_type
const
‚ĖĀconst
const_block
‚ĖĀconst_block
const_declaration
‚ĖĀconst_declaration
const_item
‚ĖĀconst_item
const_parameter
‚ĖĀconst_parameter
const_spec
‚ĖĀconst_spec
constant
‚ĖĀconstant
constant_declaration
‚ĖĀconstant_declaration
consteval
‚ĖĀconsteval
constexpr
‚ĖĀconstexpr
constinit
‚ĖĀconstinit
constrained_type
‚ĖĀconstrained_type
constraint
‚ĖĀconstraint
construct_signature
‚ĖĀconstruct_signature
constructor_body
‚ĖĀconstructor_body
constructor_suffix
‚ĖĀconstructor_suffix
constructor_type
‚ĖĀconstructor_type
continue
‚ĖĀcontinue
continue_expression
‚ĖĀcontinue_expression
continue_statement
‚ĖĀcontinue_statement
convenience
‚ĖĀconvenience
crate
‚ĖĀcrate
custom_operator
‚ĖĀcustom_operator
debugger
‚ĖĀdebugger
debugger_statement
‚ĖĀdebugger_statement
dec_statement
‚ĖĀdec_statement
declaration
‚ĖĀdeclaration
declaration_list
‚ĖĀdeclaration_list
declare
‚ĖĀdeclare
decltype
‚ĖĀdecltype
decltype_auto
‚ĖĀdecltype_auto
decorated_definition
‚ĖĀdecorated_definition
decorator
‚ĖĀdecorator
def
‚ĖĀdef
default
‚ĖĀdefault
default_case
‚ĖĀdefault_case
default_keyword
‚ĖĀdefault_keyword
default_parameter
‚ĖĀdefault_parameter
default_type
‚ĖĀdefault_type
defer
‚ĖĀdefer
defer_statement
‚ĖĀdefer_statement
defined
‚ĖĀdefined
deinit
‚ĖĀdeinit
deinit_declaration
‚ĖĀdeinit_declaration
del
‚ĖĀdel
delegate
‚ĖĀdelegate
delete
‚ĖĀdelete
delete_expression
‚ĖĀdelete_expression
delete_method_clause
‚ĖĀdelete_method_clause
delete_statement
‚ĖĀdelete_statement
delim_token_tree
‚ĖĀdelim_token_tree
delimited_symbol
‚ĖĀdelimited_symbol
dependent_identifier
‚ĖĀdependent_identifier
dependent_name
‚ĖĀdependent_name
dependent_type
‚ĖĀdependent_type
destructor_name
‚ĖĀdestructor_name
diagnostic
‚ĖĀdiagnostic
dict_pattern
‚ĖĀdict_pattern
dictionary
‚ĖĀdictionary
dictionary_literal
‚ĖĀdictionary_literal
dictionary_splat
‚ĖĀdictionary_splat
dictionary_type
‚ĖĀdictionary_type
didSet
‚ĖĀdidSet
didset_clause
‚ĖĀdidset_clause
dimensions
‚ĖĀdimensions
dimensions_expr
‚ĖĀdimensions_expr
directive
‚ĖĀdirective
distributed
‚ĖĀdistributed
do_block
‚ĖĀdo_block
do_statement
‚ĖĀdo_statement
doc_comment
‚ĖĀdoc_comment
dot
‚ĖĀdot
dotted_name
‚ĖĀdotted_name
double
‚ĖĀdouble
dsohandle
‚ĖĀdsohandle
dyn
‚ĖĀdyn
dynamic
‚ĖĀdynamic
dynamic_type
‚ĖĀdynamic_type
element_reference
‚ĖĀelement_reference
element_value_pair
‚ĖĀelement_value_pair
elif
‚ĖĀelif
elif_clause
‚ĖĀelif_clause
ellipsis
‚ĖĀellipsis
else
‚ĖĀelse
else_clause
‚ĖĀelse_clause
elsif
‚ĖĀelsif
empty_statement
‚ĖĀempty_statement
encoding
‚ĖĀencoding
end
‚ĖĀend
end_block
‚ĖĀend_block
ensure
‚ĖĀensure
enum
‚ĖĀenum
enum_assignment
‚ĖĀenum_assignment
enum_body
‚ĖĀenum_body
enum_class_body
‚ĖĀenum_class_body
enum_constant
‚ĖĀenum_constant
enum_declaration
‚ĖĀenum_declaration
enum_entry
‚ĖĀenum_entry
enum_item
‚ĖĀenum_item
enum_specifier
‚ĖĀenum_specifier
enum_type_parameters
‚ĖĀenum_type_parameters
enum_variant
‚ĖĀenum_variant
enum_variant_list
‚ĖĀenum_variant_list
enumerator
‚ĖĀenumerator
enumerator_list
‚ĖĀenumerator_list
equality_constraint
‚ĖĀequality_constraint
equality_expression
‚ĖĀequality_expression
escape_interpolation
‚ĖĀescape_interpolation
escape_sequence
‚ĖĀescape_sequence
except
‚ĖĀexcept
except_clause
‚ĖĀexcept_clause
exception_variable
‚ĖĀexception_variable
exceptions
‚ĖĀexceptions
exec
‚ĖĀexec
exec_statement
‚ĖĀexec_statement
existential_type
‚ĖĀexistential_type
expansion_statement
‚ĖĀexpansion_statement
explicit
‚ĖĀexplicit
export
‚ĖĀexport
export_clause
‚ĖĀexport_clause
export_declaration
‚ĖĀexport_declaration
export_specifier
‚ĖĀexport_specifier
export_statement
‚ĖĀexport_statement
exports
‚ĖĀexports
expr
‚ĖĀexpr
expression
‚ĖĀexpression
expression_case
‚ĖĀexpression_case
expression_list
‚ĖĀexpression_list
expression_statement
‚ĖĀexpression_statement
extends
‚ĖĀextends
extends_clause
‚ĖĀextends_clause
extends_interfaces
‚ĖĀextends_interfaces
extends_type_clause
‚ĖĀextends_type_clause
extension
‚ĖĀextension
extension_expression
‚ĖĀextension_expression
extern
‚ĖĀextern
extern_modifier
‚ĖĀextern_modifier
externalMacro
‚ĖĀexternalMacro
fallthrough
‚ĖĀfallthrough
false
‚ĖĀfalse
field_access
‚ĖĀfield_access
field_declaration
‚ĖĀfield_declaration
field_definition
‚ĖĀfield_definition
field_designator
‚ĖĀfield_designator
field_expression
‚ĖĀfield_expression
field_identifier
‚ĖĀfield_identifier
field_initializer
‚ĖĀfield_initializer
field_pattern
‚ĖĀfield_pattern
file
‚ĖĀfile
fileID
‚ĖĀfileID
fileLiteral
‚ĖĀfileLiteral
filePath
‚ĖĀfilePath
fileprivate
‚ĖĀfileprivate
final
‚ĖĀfinal
finally
‚ĖĀfinally
finally_clause
‚ĖĀfinally_clause
find_pattern
‚ĖĀfind_pattern
float
‚ĖĀfloat
float_literal
‚ĖĀfloat_literal
floating_point_type
‚ĖĀfloating_point_type
flow_maybe_type
‚ĖĀflow_maybe_type
fn
‚ĖĀfn
fold_expression
‚ĖĀfold_expression
for_clause
‚ĖĀfor_clause
for_expression
‚ĖĀfor_expression
for_in_clause
‚ĖĀfor_in_clause
for_in_statement
‚ĖĀfor_in_statement
for_lifetimes
‚ĖĀfor_lifetimes
for_range_loop
‚ĖĀfor_range_loop
for_statement
‚ĖĀfor_statement
foreign_mod_item
‚ĖĀforeign_mod_item
formal_parameter
‚ĖĀformal_parameter
formal_parameters
‚ĖĀformal_parameters
format_expression
‚ĖĀformat_expression
format_specifier
‚ĖĀformat_specifier
forward_argument
‚ĖĀforward_argument
forward_parameter
‚ĖĀforward_parameter
fragment_specifier
‚ĖĀfragment_specifier
friend
‚ĖĀfriend
friend_declaration
‚ĖĀfriend_declaration
fully_open_range
‚ĖĀfully_open_range
func
‚ĖĀfunc
func_literal
‚ĖĀfunc_literal
function
‚ĖĀfunction
function_body
‚ĖĀfunction_body
function_declaration
‚ĖĀfunction_declaration
function_declarator
‚ĖĀfunction_declarator
function_definition
‚ĖĀfunction_definition
function_expression
‚ĖĀfunction_expression
function_item
‚ĖĀfunction_item
function_modifier
‚ĖĀfunction_modifier
function_modifiers
‚ĖĀfunction_modifiers
function_signature
‚ĖĀfunction_signature
function_type
‚ĖĀfunction_type
gen
‚ĖĀgen
gen_block
‚ĖĀgen_block
generator_expression
‚ĖĀgenerator_expression
generator_function
‚ĖĀgenerator_function
generic_expression
‚ĖĀgeneric_expression
generic_function
‚ĖĀgeneric_function
generic_pattern
‚ĖĀgeneric_pattern
generic_type
‚ĖĀgeneric_type
get
‚ĖĀget
getter_specifier
‚ĖĀgetter_specifier
global
‚ĖĀglobal
global_statement
‚ĖĀglobal_statement
global_variable
‚ĖĀglobal_variable
gnu_asm_clobber_list
‚ĖĀgnu_asm_clobber_list
gnu_asm_expression
‚ĖĀgnu_asm_expression
gnu_asm_goto_list
‚ĖĀgnu_asm_goto_list
gnu_asm_qualifier
‚ĖĀgnu_asm_qualifier
go
‚ĖĀgo
go_statement
‚ĖĀgo_statement
goto
‚ĖĀgoto
goto_statement
‚ĖĀgoto_statement
guard
‚ĖĀguard
guard_statement
‚ĖĀguard_statement
hash
‚ĖĀhash
hash_bang_line
‚ĖĀhash_bang_line
hash_key_symbol
‚ĖĀhash_key_symbol
hash_pattern
‚ĖĀhash_pattern
hash_splat_argument
‚ĖĀhash_splat_argument
hash_splat_nil
‚ĖĀhash_splat_nil
hash_splat_parameter
‚ĖĀhash_splat_parameter
heredoc_beginning
‚ĖĀheredoc_beginning
heredoc_body
‚ĖĀheredoc_body
heredoc_content
‚ĖĀheredoc_content
heredoc_end
‚ĖĀheredoc_end
hex_integer_literal
‚ĖĀhex_integer_literal
hex_literal
‚ĖĀhex_literal
ident
‚ĖĀident
identifier
‚ĖĀidentifier
if_clause
‚ĖĀif_clause
if_expression
‚ĖĀif_expression
if_guard
‚ĖĀif_guard
if_modifier
‚ĖĀif_modifier
if_statement
‚ĖĀif_statement
imageLiteral
‚ĖĀimageLiteral
imaginary_literal
‚ĖĀimaginary_literal
impl
‚ĖĀimpl
impl_item
‚ĖĀimpl_item
implements
‚ĖĀimplements
implements_clause
‚ĖĀimplements_clause
import
‚ĖĀimport
import_alias
‚ĖĀimport_alias
import_attribute
‚ĖĀimport_attribute
import_clause
‚ĖĀimport_clause
import_declaration
‚ĖĀimport_declaration
import_prefix
‚ĖĀimport_prefix
import_spec
‚ĖĀimport_spec
import_spec_list
‚ĖĀimport_spec_list
import_specifier
‚ĖĀimport_specifier
import_statement
‚ĖĀimport_statement
in_clause
‚ĖĀin_clause
inc_statement
‚ĖĀinc_statement
index_expression
‚ĖĀindex_expression
index_signature
‚ĖĀindex_signature
index_type_query
‚ĖĀindex_type_query
indirect
‚ĖĀindirect
infer
‚ĖĀinfer
infer_type
‚ĖĀinfer_type
inferred_parameters
‚ĖĀinferred_parameters
infix
‚ĖĀinfix
infix_expression
‚ĖĀinfix_expression
inheritance_modifier
‚ĖĀinheritance_modifier
init
‚ĖĀinit
init_declaration
‚ĖĀinit_declaration
init_declarator
‚ĖĀinit_declarator
init_statement
‚ĖĀinit_statement
initializer_list
‚ĖĀinitializer_list
initializer_pair
‚ĖĀinitializer_pair
inline
‚ĖĀinline
inner_attribute_item
‚ĖĀinner_attribute_item
inout
‚ĖĀinout
instance_variable
‚ĖĀinstance_variable
instanceof
‚ĖĀinstanceof
int
‚ĖĀint
int_literal
‚ĖĀint_literal
integer
‚ĖĀinteger
integer_literal
‚ĖĀinteger_literal
integral_type
‚ĖĀintegral_type
interface
‚ĖĀinterface
interface_body
‚ĖĀinterface_body
interface_type
‚ĖĀinterface_type
internal
‚ĖĀinternal
internal_module
‚ĖĀinternal_module
interpolation
‚ĖĀinterpolation
intersection_type
‚ĖĀintersection_type
iota
‚ĖĀiota
isize
‚ĖĀisize
item
‚ĖĀitem
jsx_attribute
‚ĖĀjsx_attribute
jsx_closing_element
‚ĖĀjsx_closing_element
jsx_element
‚ĖĀjsx_element
jsx_expression
‚ĖĀjsx_expression
jsx_namespace_name
‚ĖĀjsx_namespace_name
jsx_opening_element
‚ĖĀjsx_opening_element
jsx_text
‚ĖĀjsx_text
keyPath
‚ĖĀkeyPath
key_path_expression
‚ĖĀkey_path_expression
keyed_element
‚ĖĀkeyed_element
keyof
‚ĖĀkeyof
keyword_argument
‚ĖĀkeyword_argument
keyword_identifier
‚ĖĀkeyword_identifier
keyword_parameter
‚ĖĀkeyword_parameter
keyword_pattern
‚ĖĀkeyword_pattern
keyword_separator
‚ĖĀkeyword_separator
label
‚ĖĀlabel
label_name
‚ĖĀlabel_name
labeled_statement
‚ĖĀlabeled_statement
lambda
‚ĖĀlambda
lambda_declarator
‚ĖĀlambda_declarator
lambda_expression
‚ĖĀlambda_expression
lambda_function_type
‚ĖĀlambda_function_type
lambda_literal
‚ĖĀlambda_literal
lambda_parameter
‚ĖĀlambda_parameter
lambda_parameters
‚ĖĀlambda_parameters
lambda_specifier
‚ĖĀlambda_specifier
lazy
‚ĖĀlazy
left_assignment_list
‚ĖĀleft_assignment_list
let
‚ĖĀlet
let_chain
‚ĖĀlet_chain
let_condition
‚ĖĀlet_condition
let_declaration
‚ĖĀlet_declaration
lexical_declaration
‚ĖĀlexical_declaration
lifetime
‚ĖĀlifetime
lifetime_parameter
‚ĖĀlifetime_parameter
line
‚ĖĀline
line_str_text
‚ĖĀline_str_text
line_string_literal
‚ĖĀline_string_literal
list
‚ĖĀlist
list_comprehension
‚ĖĀlist_comprehension
list_pattern
‚ĖĀlist_pattern
list_splat
‚ĖĀlist_splat
list_splat_pattern
‚ĖĀlist_splat_pattern
literal
‚ĖĀliteral
literal_element
‚ĖĀliteral_element
literal_suffix
‚ĖĀliteral_suffix
literal_type
‚ĖĀliteral_type
literal_value
‚ĖĀliteral_value
long
‚ĖĀlong
lookup_type
‚ĖĀlookup_type
loop
‚ĖĀloop
loop_expression
‚ĖĀloop_expression
macro_declaration
‚ĖĀmacro_declaration
macro_definition
‚ĖĀmacro_definition
macro_invocation
‚ĖĀmacro_invocation
macro_rule
‚ĖĀmacro_rule
macro_type_specifier
‚ĖĀmacro_type_specifier
make
‚ĖĀmake
map
‚ĖĀmap
map_type
‚ĖĀmap_type
mapped_type_clause
‚ĖĀmapped_type_clause
marker_annotation
‚ĖĀmarker_annotation
match
‚ĖĀmatch
match_arm
‚ĖĀmatch_arm
match_block
‚ĖĀmatch_block
match_expression
‚ĖĀmatch_expression
match_pattern
‚ĖĀmatch_pattern
match_statement
‚ĖĀmatch_statement
member_expression
‚ĖĀmember_expression
member_modifier
‚ĖĀmember_modifier
member_type
‚ĖĀmember_type
meta
‚ĖĀmeta
meta_property
‚ĖĀmeta_property
metatype
‚ĖĀmetatype
metavariable
‚ĖĀmetavariable
method
‚ĖĀmethod
method_declaration
‚ĖĀmethod_declaration
method_definition
‚ĖĀmethod_definition
method_elem
‚ĖĀmethod_elem
method_invocation
‚ĖĀmethod_invocation
method_parameters
‚ĖĀmethod_parameters
method_reference
‚ĖĀmethod_reference
method_signature
‚ĖĀmethod_signature
mod
‚ĖĀmod
mod_item
‚ĖĀmod_item
modifiers
‚ĖĀmodifiers
modify_specifier
‚ĖĀmodify_specifier
module
‚ĖĀmodule
module_body
‚ĖĀmodule_body
module_declaration
‚ĖĀmodule_declaration
module_directive
‚ĖĀmodule_directive
module_name
‚ĖĀmodule_name
module_partition
‚ĖĀmodule_partition
move
‚ĖĀmove
ms_based_modifier
‚ĖĀms_based_modifier
ms_call_modifier
‚ĖĀms_call_modifier
ms_declspec_modifier
‚ĖĀms_declspec_modifier
ms_pointer_modifier
‚ĖĀms_pointer_modifier
ms_restrict_modifier
‚ĖĀms_restrict_modifier
multi_line_str_text
‚ĖĀmulti_line_str_text
multiline_comment
‚ĖĀmultiline_comment
mut
‚ĖĀmut
mut_pattern
‚ĖĀmut_pattern
mutable
‚ĖĀmutable
mutable_specifier
‚ĖĀmutable_specifier
mutating
‚ĖĀmutating
mutation_modifier
‚ĖĀmutation_modifier
named_expression
‚ĖĀnamed_expression
named_imports
‚ĖĀnamed_imports
namespace
‚ĖĀnamespace
namespace_definition
‚ĖĀnamespace_definition
namespace_export
‚ĖĀnamespace_export
namespace_identifier
‚ĖĀnamespace_identifier
namespace_import
‚ĖĀnamespace_import
native
‚ĖĀnative
navigation_suffix
‚ĖĀnavigation_suffix
negated_type
‚ĖĀnegated_type
negative_literal
‚ĖĀnegative_literal
nested_identifier
‚ĖĀnested_identifier
never
‚ĖĀnever
never_type
‚ĖĀnever_type
new
‚ĖĀnew
new_declarator
‚ĖĀnew_declarator
new_expression
‚ĖĀnew_expression
next
‚ĖĀnext
next_command
‚ĖĀnext_command
nil
‚ĖĀnil
noexcept
‚ĖĀnoexcept
non_null_expression
‚ĖĀnon_null_expression
none
‚ĖĀnone
nonisolated
‚ĖĀnonisolated
nonlocal
‚ĖĀnonlocal
nonlocal_statement
‚ĖĀnonlocal_statement
nonmutating
‚ĖĀnonmutating
noreturn
‚ĖĀnoreturn
not_eq
‚ĖĀnot_eq
not_operator
‚ĖĀnot_operator
null
‚ĖĀnull
null_literal
‚ĖĀnull_literal
nullptr
‚ĖĀnullptr
number
‚ĖĀnumber
number_literal
‚ĖĀnumber_literal
object
‚ĖĀobject
object_pattern
‚ĖĀobject_pattern
object_type
‚ĖĀobject_type
oct_literal
‚ĖĀoct_literal
offsetof
‚ĖĀoffsetof
offsetof_expression
‚ĖĀoffsetof_expression
opaque_type
‚ĖĀopaque_type
open
‚ĖĀopen
opens
‚ĖĀopens
operator
‚ĖĀoperator
operator_assignment
‚ĖĀoperator_assignment
operator_cast
‚ĖĀoperator_cast
operator_declaration
‚ĖĀoperator_declaration
operator_name
‚ĖĀoperator_name
optional
‚ĖĀoptional
optional_chain
‚ĖĀoptional_chain
optional_parameter
‚ĖĀoptional_parameter
optional_type
‚ĖĀoptional_type
or_eq
‚ĖĀor_eq
or_pattern
‚ĖĀor_pattern
os
‚ĖĀos
override
‚ĖĀoverride
override_modifier
‚ĖĀoverride_modifier
ownership_modifier
‚ĖĀownership_modifier
package
‚ĖĀpackage
package_clause
‚ĖĀpackage_clause
package_declaration
‚ĖĀpackage_declaration
package_identifier
‚ĖĀpackage_identifier
pair
‚ĖĀpair
pair_pattern
‚ĖĀpair_pattern
param
‚ĖĀparam
parameter
‚ĖĀparameter
parameter_list
‚ĖĀparameter_list
parameter_modifier
‚ĖĀparameter_modifier
parameter_modifiers
‚ĖĀparameter_modifiers
parameters
‚ĖĀparameters
parenthesized_type
‚ĖĀparenthesized_type
parenthesized_unary
‚ĖĀparenthesized_unary
pass
‚ĖĀpass
pass_statement
‚ĖĀpass_statement
pat
‚ĖĀpat
path
‚ĖĀpath
pattern
‚ĖĀpattern
pattern_list
‚ĖĀpattern_list
permits
‚ĖĀpermits
playground_literal
‚ĖĀplayground_literal
pointer_declarator
‚ĖĀpointer_declarator
pointer_expression
‚ĖĀpointer_expression
pointer_type
‚ĖĀpointer_type
positional_separator
‚ĖĀpositional_separator
postfix
‚ĖĀpostfix
postfix_expression
‚ĖĀpostfix_expression
precedencegroup
‚ĖĀprecedencegroup
predefined_type
‚ĖĀpredefined_type
prefix
‚ĖĀprefix
prefix_expression
‚ĖĀprefix_expression
preproc_arg
‚ĖĀpreproc_arg
preproc_call
‚ĖĀpreproc_call
preproc_def
‚ĖĀpreproc_def
preproc_defined
‚ĖĀpreproc_defined
preproc_directive
‚ĖĀpreproc_directive
preproc_elif
‚ĖĀpreproc_elif
preproc_elifdef
‚ĖĀpreproc_elifdef
preproc_else
‚ĖĀpreproc_else
preproc_function_def
‚ĖĀpreproc_function_def
preproc_if
‚ĖĀpreproc_if
preproc_ifdef
‚ĖĀpreproc_ifdef
preproc_include
‚ĖĀpreproc_include
preproc_params
‚ĖĀpreproc_params
primary_expression
‚ĖĀprimary_expression
primary_type
‚ĖĀprimary_type
primitive_type
‚ĖĀprimitive_type
print
‚ĖĀprint
print_statement
‚ĖĀprint_statement
private
‚ĖĀprivate
program
‚ĖĀprogram
property
‚ĖĀproperty
property_declaration
‚ĖĀproperty_declaration
property_identifier
‚ĖĀproperty_identifier
property_modifier
‚ĖĀproperty_modifier
property_signature
‚ĖĀproperty_signature
protected
‚ĖĀprotected
protocol
‚ĖĀprotocol
protocol_body
‚ĖĀprotocol_body
protocol_declaration
‚ĖĀprotocol_declaration
provides
‚ĖĀprovides
pub
‚ĖĀpub
public
‚ĖĀpublic
pure_virtual_clause
‚ĖĀpure_virtual_clause
qualified_identifier
‚ĖĀqualified_identifier
qualified_type
‚ĖĀqualified_type
raise
‚ĖĀraise
raise_statement
‚ĖĀraise_statement
range
‚ĖĀrange
range_clause
‚ĖĀrange_clause
range_expression
‚ĖĀrange_expression
range_pattern
‚ĖĀrange_pattern
rational
‚ĖĀrational
raw
‚ĖĀraw
raw_str_end_part
‚ĖĀraw_str_end_part
raw_str_part
‚ĖĀraw_str_part
raw_string_content
‚ĖĀraw_string_content
raw_string_delimiter
‚ĖĀraw_string_delimiter
raw_string_literal
‚ĖĀraw_string_literal
readonly
‚ĖĀreadonly
readonly_type
‚ĖĀreadonly_type
real_literal
‚ĖĀreal_literal
receive_statement
‚ĖĀreceive_statement
receiver
‚ĖĀreceiver
receiver_parameter
‚ĖĀreceiver_parameter
record
‚ĖĀrecord
record_declaration
‚ĖĀrecord_declaration
record_pattern
‚ĖĀrecord_pattern
record_pattern_body
‚ĖĀrecord_pattern_body
redo
‚ĖĀredo
ref
‚ĖĀref
ref_pattern
‚ĖĀref_pattern
ref_qualifier
‚ĖĀref_qualifier
reference_declarator
‚ĖĀreference_declarator
reference_expression
‚ĖĀreference_expression
reference_pattern
‚ĖĀreference_pattern
reference_type
‚ĖĀreference_type
reflect_expression
‚ĖĀreflect_expression
regex
‚ĖĀregex
regex_flags
‚ĖĀregex_flags
regex_literal
‚ĖĀregex_literal
regex_pattern
‚ĖĀregex_pattern
register
‚ĖĀregister
relative_import
‚ĖĀrelative_import
removed_trait_bound
‚ĖĀremoved_trait_bound
repeat
‚ĖĀrepeat
require
‚ĖĀrequire
required
‚ĖĀrequired
required_parameter
‚ĖĀrequired_parameter
requirement_seq
‚ĖĀrequirement_seq
requires
‚ĖĀrequires
requires_clause
‚ĖĀrequires_clause
requires_expression
‚ĖĀrequires_expression
requires_modifier
‚ĖĀrequires_modifier
rescue
‚ĖĀrescue
rescue_modifier
‚ĖĀrescue_modifier
rescue_modifier_arg
‚ĖĀrescue_modifier_arg
resource
‚ĖĀresource
rest_assignment
‚ĖĀrest_assignment
rest_pattern
‚ĖĀrest_pattern
rest_type
‚ĖĀrest_type
restrict
‚ĖĀrestrict
retry
‚ĖĀretry
return
‚ĖĀreturn
return_command
‚ĖĀreturn_command
return_expression
‚ĖĀreturn_expression
return_statement
‚ĖĀreturn_statement
ri
‚ĖĀri
rune_literal
‚ĖĀrune_literal
satisfies
‚ĖĀsatisfies
satisfies_expression
‚ĖĀsatisfies_expression
scope_resolution
‚ĖĀscope_resolution
scoped_identifier
‚ĖĀscoped_identifier
scoped_use_list
‚ĖĀscoped_use_list
sealed
‚ĖĀsealed
seh_except_clause
‚ĖĀseh_except_clause
seh_finally_clause
‚ĖĀseh_finally_clause
seh_leave_statement
‚ĖĀseh_leave_statement
seh_try_statement
‚ĖĀseh_try_statement
select
‚ĖĀselect
select_statement
‚ĖĀselect_statement
selector
‚ĖĀselector
selector_expression
‚ĖĀselector_expression
self
‚ĖĀself
self_expression
‚ĖĀself_expression
self_parameter
‚ĖĀself_parameter
send_statement
‚ĖĀsend_statement
sequence_expression
‚ĖĀsequence_expression
set
‚ĖĀset
set_comprehension
‚ĖĀset_comprehension
setparam
‚ĖĀsetparam
setter
‚ĖĀsetter
setter_specifier
‚ĖĀsetter_specifier
shebang
‚ĖĀshebang
shebang_line
‚ĖĀshebang_line
short
‚ĖĀshort
signed
‚ĖĀsigned
simple_identifier
‚ĖĀsimple_identifier
simple_requirement
‚ĖĀsimple_requirement
simple_symbol
‚ĖĀsimple_symbol
singleton_class
‚ĖĀsingleton_class
singleton_method
‚ĖĀsingleton_method
sized_type_specifier
‚ĖĀsized_type_specifier
sizeof
‚ĖĀsizeof
sizeof_expression
‚ĖĀsizeof_expression
slice
‚ĖĀslice
slice_expression
‚ĖĀslice_expression
slice_pattern
‚ĖĀslice_pattern
slice_type
‚ĖĀslice_type
source_file
‚ĖĀsource_file
special_literal
‚ĖĀspecial_literal
splat_argument
‚ĖĀsplat_argument
splat_parameter
‚ĖĀsplat_parameter
splat_pattern
‚ĖĀsplat_pattern
splat_type
‚ĖĀsplat_type
splice_expression
‚ĖĀsplice_expression
splice_specifier
‚ĖĀsplice_specifier
spread_element
‚ĖĀspread_element
spread_parameter
‚ĖĀspread_parameter
statement
‚ĖĀstatement
statement_block
‚ĖĀstatement_block
statement_identifier
‚ĖĀstatement_identifier
statement_label
‚ĖĀstatement_label
statement_list
‚ĖĀstatement_list
statements
‚ĖĀstatements
static
‚ĖĀstatic
static_assert
‚ĖĀstatic_assert
static_initializer
‚ĖĀstatic_initializer
static_item
‚ĖĀstatic_item
stmt
‚ĖĀstmt
str
‚ĖĀstr
str_escaped_char
‚ĖĀstr_escaped_char
strictfp
‚ĖĀstrictfp
string
‚ĖĀstring
string_array
‚ĖĀstring_array
string_content
‚ĖĀstring_content
string_end
‚ĖĀstring_end
string_fragment
‚ĖĀstring_fragment
string_interpolation
‚ĖĀstring_interpolation
string_literal
‚ĖĀstring_literal
string_start
‚ĖĀstring_start
struct
‚ĖĀstruct
struct_expression
‚ĖĀstruct_expression
struct_item
‚ĖĀstruct_item
struct_pattern
‚ĖĀstruct_pattern
struct_specifier
‚ĖĀstruct_specifier
struct_type
‚ĖĀstruct_type
subscript
‚ĖĀsubscript
subscript_designator
‚ĖĀsubscript_designator
subscript_expression
‚ĖĀsubscript_expression
subshell
‚ĖĀsubshell
super_expression
‚ĖĀsuper_expression
super_interfaces
‚ĖĀsuper_interfaces
superclass
‚ĖĀsuperclass
swift
‚ĖĀswift
switch
‚ĖĀswitch
switch_block
‚ĖĀswitch_block
switch_body
‚ĖĀswitch_body
switch_case
‚ĖĀswitch_case
switch_default
‚ĖĀswitch_default
switch_entry
‚ĖĀswitch_entry
switch_expression
‚ĖĀswitch_expression
switch_label
‚ĖĀswitch_label
switch_pattern
‚ĖĀswitch_pattern
switch_rule
‚ĖĀswitch_rule
switch_statement
‚ĖĀswitch_statement
symbol
‚ĖĀsymbol
symbol_array
‚ĖĀsymbol_array
synchronized
‚ĖĀsynchronized
system_lib_string
‚ĖĀsystem_lib_string
target
‚ĖĀtarget
targetEnvironment
‚ĖĀtargetEnvironment
template
‚ĖĀtemplate
template_declaration
‚ĖĀtemplate_declaration
template_expression
‚ĖĀtemplate_expression
template_function
‚ĖĀtemplate_function
template_method
‚ĖĀtemplate_method
template_string
‚ĖĀtemplate_string
template_type
‚ĖĀtemplate_type
ternary_expression
‚ĖĀternary_expression
test_pattern
‚ĖĀtest_pattern
then
‚ĖĀthen
this_type
‚ĖĀthis_type
throw
‚ĖĀthrow
throw_keyword
‚ĖĀthrow_keyword
throw_specifier
‚ĖĀthrow_specifier
throw_statement
‚ĖĀthrow_statement
throws
‚ĖĀthrows
token_repetition
‚ĖĀtoken_repetition
token_tree
‚ĖĀtoken_tree
token_tree_pattern
‚ĖĀtoken_tree_pattern
trailing_return_type
‚ĖĀtrailing_return_type
trait
‚ĖĀtrait
trait_bounds
‚ĖĀtrait_bounds
trait_item
‚ĖĀtrait_item
transient
‚ĖĀtransient
transitive
‚ĖĀtransitive
translation_unit
‚ĖĀtranslation_unit
true
‚ĖĀtrue
try
‚ĖĀtry
try_block
‚ĖĀtry_block
try_expression
‚ĖĀtry_expression
try_operator
‚ĖĀtry_operator
try_statement
‚ĖĀtry_statement
tt
‚ĖĀtt
tuple
‚ĖĀtuple
tuple_expression
‚ĖĀtuple_expression
tuple_pattern
‚ĖĀtuple_pattern
tuple_struct_pattern
‚ĖĀtuple_struct_pattern
tuple_type
‚ĖĀtuple_type
tuple_type_item
‚ĖĀtuple_type_item
ty
‚ĖĀty
type
‚ĖĀtype
type_alias
‚ĖĀtype_alias
type_alias_statement
‚ĖĀtype_alias_statement
type_annotation
‚ĖĀtype_annotation
type_arguments
‚ĖĀtype_arguments
type_assertion
‚ĖĀtype_assertion
type_binding
‚ĖĀtype_binding
type_bound
‚ĖĀtype_bound
type_case
‚ĖĀtype_case
type_cast_expression
‚ĖĀtype_cast_expression
type_constraint
‚ĖĀtype_constraint
type_constraints
‚ĖĀtype_constraints
type_conversion
‚ĖĀtype_conversion
type_declaration
‚ĖĀtype_declaration
type_definition
‚ĖĀtype_definition
type_descriptor
‚ĖĀtype_descriptor
type_elem
‚ĖĀtype_elem
type_identifier
‚ĖĀtype_identifier
type_item
‚ĖĀtype_item
type_list
‚ĖĀtype_list
type_modifiers
‚ĖĀtype_modifiers
type_pack_expansion
‚ĖĀtype_pack_expansion
type_parameter
‚ĖĀtype_parameter
type_parameter_list
‚ĖĀtype_parameter_list
type_parameter_pack
‚ĖĀtype_parameter_pack
type_parameters
‚ĖĀtype_parameters
type_pattern
‚ĖĀtype_pattern
type_predicate
‚ĖĀtype_predicate
type_qualifier
‚ĖĀtype_qualifier
type_query
‚ĖĀtype_query
type_requirement
‚ĖĀtype_requirement
type_spec
‚ĖĀtype_spec
type_specifier
‚ĖĀtype_specifier
typealias
‚ĖĀtypealias
typed_parameter
‚ĖĀtyped_parameter
typedef
‚ĖĀtypedef
typename
‚ĖĀtypename
typeof
‚ĖĀtypeof
unary
‚ĖĀunary
unary_expression
‚ĖĀunary_expression
unary_operator
‚ĖĀunary_operator
unavailable
‚ĖĀunavailable
undef
‚ĖĀundef
undefined
‚ĖĀundefined
underscore_pattern
‚ĖĀunderscore_pattern
uninterpreted
‚ĖĀuninterpreted
union
‚ĖĀunion
union_item
‚ĖĀunion_item
union_pattern
‚ĖĀunion_pattern
union_specifier
‚ĖĀunion_specifier
union_type
‚ĖĀunion_type
unique
‚ĖĀunique
unit_expression
‚ĖĀunit_expression
unit_type
‚ĖĀunit_type
unknown
‚ĖĀunknown
unless_guard
‚ĖĀunless_guard
unless_modifier
‚ĖĀunless_modifier
unowned
‚ĖĀunowned
unsafe
‚ĖĀunsafe
unsafe_block
‚ĖĀunsafe_block
unsigned
‚ĖĀunsigned
until_modifier
‚ĖĀuntil_modifier
update_expression
‚ĖĀupdate_expression
use
‚ĖĀuse
use_as_clause
‚ĖĀuse_as_clause
use_bounds
‚ĖĀuse_bounds
use_declaration
‚ĖĀuse_declaration
use_list
‚ĖĀuse_list
use_site_target
‚ĖĀuse_site_target
use_wildcard
‚ĖĀuse_wildcard
user_defined_literal
‚ĖĀuser_defined_literal
user_type
‚ĖĀuser_type
uses
‚ĖĀuses
using
‚ĖĀusing
using_declaration
‚ĖĀusing_declaration
usize
‚ĖĀusize
value_argument
‚ĖĀvalue_argument
value_argument_label
‚ĖĀvalue_argument_label
value_arguments
‚ĖĀvalue_arguments
value_pack_expansion
‚ĖĀvalue_pack_expansion
value_parameter_pack
‚ĖĀvalue_parameter_pack
var
‚ĖĀvar
var_declaration
‚ĖĀvar_declaration
var_spec
‚ĖĀvar_spec
var_spec_list
‚ĖĀvar_spec_list
variable_declaration
‚ĖĀvariable_declaration
variable_declarator
‚ĖĀvariable_declarator
variadic_argument
‚ĖĀvariadic_argument
variadic_declarator
‚ĖĀvariadic_declarator
variadic_parameter
‚ĖĀvariadic_parameter
virtual
‚ĖĀvirtual
virtual_specifier
‚ĖĀvirtual_specifier
vis
‚ĖĀvis
visibility_modifier
‚ĖĀvisibility_modifier
void
‚ĖĀvoid
void_type
‚ĖĀvoid_type
volatile
‚ĖĀvolatile
weak
‚ĖĀweak
where_clause
‚ĖĀwhere_clause
where_keyword
‚ĖĀwhere_keyword
where_predicate
‚ĖĀwhere_predicate
while_expression
‚ĖĀwhile_expression
while_modifier
‚ĖĀwhile_modifier
while_statement
‚ĖĀwhile_statement
wildcard
‚ĖĀwildcard
wildcard_import
‚ĖĀwildcard_import
wildcard_pattern
‚ĖĀwildcard_pattern
willSet
‚ĖĀwillSet
willset_clause
‚ĖĀwillset_clause
willset_didset_block
‚ĖĀwillset_didset_block
with_clause
‚ĖĀwith_clause
with_item
‚ĖĀwith_item
with_statement
‚ĖĀwith_statement
xor
‚ĖĀxor
xor_eq
‚ĖĀxor_eq
yield
‚ĖĀyield
yield_command
‚ĖĀyield_command
yield_expression
‚ĖĀyield_expression
yield_statement
‚ĖĀyield_statement
size_t
‚ĖĀsize_t
ptrdiff_t
‚ĖĀptrdiff_t
int8_t
‚ĖĀint8_t
int16_t
‚ĖĀint16_t
int32_t
‚ĖĀint32_t
int64_t
‚ĖĀint64_t
uint8_t
‚ĖĀuint8_t
uint16_t
‚ĖĀuint16_t
uint32_t
‚ĖĀuint32_t
uint64_t
‚ĖĀuint64_t
malloc
‚ĖĀmalloc
free
‚ĖĀfree
calloc
‚ĖĀcalloc
realloc
‚ĖĀrealloc
memcpy
‚ĖĀmemcpy
memset
‚ĖĀmemset
printf
‚ĖĀprintf
fprintf
‚ĖĀfprintf
sprintf
‚ĖĀsprintf
scanf
‚ĖĀscanf
fopen
‚ĖĀfopen
fclose
‚ĖĀfclose
fread
‚ĖĀfread
fwrite
‚ĖĀfwrite
wchar_t
‚ĖĀwchar_t
int8
‚ĖĀint8
int16
‚ĖĀint16
int32
‚ĖĀint32
int64
‚ĖĀint64
uint
‚ĖĀuint
uint8
‚ĖĀuint8
uint16
‚ĖĀuint16
uint32
‚ĖĀuint32
uint64
‚ĖĀuint64
uintptr
‚ĖĀuintptr
rune
‚ĖĀrune
float32
‚ĖĀfloat32
float64
‚ĖĀfloat64
complex64
‚ĖĀcomplex64
complex128
‚ĖĀcomplex128
error
‚ĖĀerror
len
‚ĖĀlen
cap
‚ĖĀcap
append
‚ĖĀappend
copy
‚ĖĀcopy
panic
‚ĖĀpanic
recover
‚ĖĀrecover
fmt
‚ĖĀfmt
Println
‚ĖĀPrintln
Printf
‚ĖĀPrintf
Object
‚ĖĀObject
String
‚ĖĀString
Integer
‚ĖĀInteger
Long
‚ĖĀLong
Boolean
‚ĖĀBoolean
Double
‚ĖĀDouble
Float
‚ĖĀFloat
Byte
‚ĖĀByte
Short
‚ĖĀShort
Character
‚ĖĀCharacter
System
‚ĖĀSystem
ArrayList
‚ĖĀArrayList
HashMap
‚ĖĀHashMap
LinkedList
‚ĖĀLinkedList
Iterator
‚ĖĀIterator
Override
‚ĖĀOverride
dict
‚ĖĀdict
bytes
‚ĖĀbytes
cls
‚ĖĀcls
proc
‚ĖĀproc
attr_accessor
‚ĖĀattr_accessor
attr_reader
‚ĖĀattr_reader
attr_writer
‚ĖĀattr_writer
include
‚ĖĀinclude
extend
‚ĖĀextend
to_s
‚ĖĀto_s
i8
‚ĖĀi8
i16
‚ĖĀi16
i32
‚ĖĀi32
i64
‚ĖĀi64
i128
‚ĖĀi128
u8
‚ĖĀu8
u16
‚ĖĀu16
u32
‚ĖĀu32
u64
‚ĖĀu64
u128
‚ĖĀu128
f32
‚ĖĀf32
f64
‚ĖĀf64
Vec
‚ĖĀVec
Option
‚ĖĀOption
Result
‚ĖĀResult
Some
‚ĖĀSome
Ok
‚ĖĀOk
Err
‚ĖĀErr
Box
‚ĖĀBox
Rc
‚ĖĀRc
Arc
‚ĖĀArc
BTreeMap
‚ĖĀBTreeMap
Self
‚ĖĀSelf
Int
‚ĖĀInt
Bool
‚ĖĀBool
Array
‚ĖĀArray
Dictionary
‚ĖĀDictionary
Optional
‚ĖĀOptional
Any
‚ĖĀAny
AnyObject
‚ĖĀAnyObject
Void
‚ĖĀVoid
rethrows
‚ĖĀrethrows
Promise
‚ĖĀPromise
Map
‚ĖĀMap
Set
‚ĖĀSet
Symbol
‚ĖĀSymbol
RegExp
‚ĖĀRegExp
ACTION
‚ĖĀACTION
ADJUST
‚ĖĀADJUST
ADVANCING
‚ĖĀADVANCING
AFTER
‚ĖĀAFTER
ALL
‚ĖĀALL
ALPHABETIC
‚ĖĀALPHABETIC
ALPHABETIC_LOWER
‚ĖĀALPHABETIC_LOWER
ALPHABETIC_UPPER
‚ĖĀALPHABETIC_UPPER
ALPHANUMERIC
‚ĖĀALPHANUMERIC
ALPHANUMERIC_EDITED
‚ĖĀALPHANUMERIC_EDITED
ALSO
‚ĖĀALSO
AND
‚ĖĀAND
AND_EQ
‚ĖĀAND_EQ
AND_GE
‚ĖĀAND_GE
AND_GT
‚ĖĀAND_GT
AND_LE
‚ĖĀAND_LE
AND_LT
‚ĖĀAND_LT
AND_NE
‚ĖĀAND_NE
ANY
‚ĖĀANY
ASCENDING
‚ĖĀASCENDING
ASSUME
‚ĖĀASSUME
ASSUMPTION
‚ĖĀASSUMPTION
ATTLIST
‚ĖĀATTLIST
AUTOMATIC
‚ĖĀAUTOMATIC
AXIOM
‚ĖĀAXIOM
AttDef
‚ĖĀAttDef
AttValue
‚ĖĀAttValue
AttlistDecl
‚ĖĀAttlistDecl
Attribute
‚ĖĀAttribute
BACKGROUND_COLOR
‚ĖĀBACKGROUND_COLOR
BEFORE
‚ĖĀBEFORE
BELL
‚ĖĀBELL
BINARY_CHAR
‚ĖĀBINARY_CHAR
BINARY_C_LONG
‚ĖĀBINARY_C_LONG
BINARY_DOUBLE
‚ĖĀBINARY_DOUBLE
BINARY_LONG
‚ĖĀBINARY_LONG
BINARY_SHORT
‚ĖĀBINARY_SHORT
BLANK_LINE
‚ĖĀBLANK_LINE
BLANK_SCREEN
‚ĖĀBLANK_SCREEN
BLINK
‚ĖĀBLINK
BOOL
‚ĖĀBOOL
BOOLEAN
‚ĖĀBOOLEAN
BUILD
‚ĖĀBUILD
BY
‚ĖĀBY
CACHE
‚ĖĀCACHE
CASE
‚ĖĀCASE
CDATA
‚ĖĀCDATA
CDSect
‚ĖĀCDSect
CDStart
‚ĖĀCDStart
CData
‚ĖĀCData
CHARACTERS
‚ĖĀCHARACTERS
CHOOSE
‚ĖĀCHOOSE
CLASS_NAME
‚ĖĀCLASS_NAME
CONCATENATE_FUNC
‚ĖĀCONCATENATE_FUNC
CONSTANT
‚ĖĀCONSTANT
CONSTANTS
‚ĖĀCONSTANTS
COROLLARY
‚ĖĀCOROLLARY
CORRESPONDING
‚ĖĀCORRESPONDING
CRT
‚ĖĀCRT
CURRENT_DATE_FUNC
‚ĖĀCURRENT_DATE_FUNC
CYCLE
‚ĖĀCYCLE
Cdecl
‚ĖĀCdecl
CharData
‚ĖĀCharData
CharRef
‚ĖĀCharRef
Class
‚ĖĀClass
Comment
‚ĖĀComment
DEF
‚ĖĀDEF
DEFINE
‚ĖĀDEFINE
DEFS
‚ĖĀDEFS
DESCENDING
‚ĖĀDESCENDING
DOCTYPE
‚ĖĀDOCTYPE
DOMAIN
‚ĖĀDOMAIN
DOWN
‚ĖĀDOWN
DYNAMIC
‚ĖĀDYNAMIC
DefaultDecl
‚ĖĀDefaultDecl
ELEMENT
‚ĖĀELEMENT
ELSE
‚ĖĀELSE
EMPTY
‚ĖĀEMPTY
ENABLED
‚ĖĀENABLED
END_ACCEPT
‚ĖĀEND_ACCEPT
END_ADD
‚ĖĀEND_ADD
END_CALL
‚ĖĀEND_CALL
END_COMPUTE
‚ĖĀEND_COMPUTE
END_DELETE
‚ĖĀEND_DELETE
END_DISPLAY
‚ĖĀEND_DISPLAY
END_DIVIDE
‚ĖĀEND_DIVIDE
END_EVALUATE
‚ĖĀEND_EVALUATE
END_IF
‚ĖĀEND_IF
END_MULTIPLY
‚ĖĀEND_MULTIPLY
END_PERFORM
‚ĖĀEND_PERFORM
END_READ
‚ĖĀEND_READ
END_RETURN
‚ĖĀEND_RETURN
END_REWRITE
‚ĖĀEND_REWRITE
END_SEARCH
‚ĖĀEND_SEARCH
END_START
‚ĖĀEND_START
END_STRING
‚ĖĀEND_STRING
END_SUBTRACT
‚ĖĀEND_SUBTRACT
END_UNSTRING
‚ĖĀEND_UNSTRING
END_WRITE
‚ĖĀEND_WRITE
ENTITIES
‚ĖĀENTITIES
ENTITY
‚ĖĀENTITY
ENUM
‚ĖĀENUM
ENV
‚ĖĀENV
EOL
‚ĖĀEOL
EOS
‚ĖĀEOS
ERASE
‚ĖĀERASE
ESCAPE
‚ĖĀESCAPE
ETag
‚ĖĀETag
EXCEPT
‚ĖĀEXCEPT
EXCLUSIVE
‚ĖĀEXCLUSIVE
EXTENDS
‚ĖĀEXTENDS
EXTERNAL
‚ĖĀEXTERNAL
EmptyElemTag
‚ĖĀEmptyElemTag
EncName
‚ĖĀEncName
EntityRef
‚ĖĀEntityRef
EntityValue
‚ĖĀEntityValue
Enumeration
‚ĖĀEnumeration
ExternalID
‚ĖĀExternalID
FALLBACK
‚ĖĀFALLBACK
FD
‚ĖĀFD
FIELD
‚ĖĀFIELD
FOREGROUND_COLOR
‚ĖĀFOREGROUND_COLOR
FOREVER
‚ĖĀFOREVER
Fastcall
‚ĖĀFastcall
Function
‚ĖĀFunction
GEDecl
‚ĖĀGEDecl
GLOBAL
‚ĖĀGLOBAL
HAVE
‚ĖĀHAVE
HIDE
‚ĖĀHIDE
HIGHLIGHT
‚ĖĀHIGHLIGHT
HIGH_VALUE
‚ĖĀHIGH_VALUE
IBInspectable
‚ĖĀIBInspectable
IBOutlet
‚ĖĀIBOutlet
ID
‚ĖĀID
IDREF
‚ĖĀIDREF
IDREFS
‚ĖĀIDREFS
IF
‚ĖĀIF
IGNORE
‚ĖĀIGNORE
IMP
‚ĖĀIMP
IN
‚ĖĀIN
INDEXED
‚ĖĀINDEXED
INSTANCE
‚ĖĀINSTANCE
INTERFACE
‚ĖĀINTERFACE
Inf
‚ĖĀInf
KEY
‚ĖĀKEY
LAMBDA
‚ĖĀLAMBDA
LEMMA
‚ĖĀLEMMA
LENGTH
‚ĖĀLENGTH
LET
‚ĖĀLET
LF
‚ĖĀLF
LINE
‚ĖĀLINE
LINES
‚ĖĀLINES
LITERAL
‚ĖĀLITERAL
LOCAL
‚ĖĀLOCAL
LOCALE_DT_FUNC
‚ĖĀLOCALE_DT_FUNC
LOCK
‚ĖĀLOCK
LOWER_CASE_FUNC
‚ĖĀLOWER_CASE_FUNC
LOWLIGHT
‚ĖĀLOWLIGHT
LOW_VALUE
‚ĖĀLOW_VALUE
MANUAL
‚ĖĀMANUAL
MNEMONIC_NAME
‚ĖĀMNEMONIC_NAME
MODULE
‚ĖĀMODULE
MUTATION
‚ĖĀMUTATION
Mixed
‚ĖĀMixed
NA
‚ĖĀNA
NATIONAL
‚ĖĀNATIONAL
NATIONAL_EDITED
‚ĖĀNATIONAL_EDITED
NDATA
‚ĖĀNDATA
NDataDecl
‚ĖĀNDataDecl
NEGATIVE
‚ĖĀNEGATIVE
NEW
‚ĖĀNEW
NMTOKEN
‚ĖĀNMTOKEN
NMTOKENS
‚ĖĀNMTOKENS
NO
‚ĖĀNO
NONE
‚ĖĀNONE
NOT
‚ĖĀNOT
NOTATION
‚ĖĀNOTATION
NOT_ALPHABETIC
‚ĖĀNOT_ALPHABETIC
NOT_ALPHABETIC_LOWER
‚ĖĀNOT_ALPHABETIC_LOWER
NOT_ALPHABETIC_UPPER
‚ĖĀNOT_ALPHABETIC_UPPER
NOT_CLASS_NAME
‚ĖĀNOT_CLASS_NAME
NOT_NEGATIVE
‚ĖĀNOT_NEGATIVE
NOT_NUMERIC
‚ĖĀNOT_NUMERIC
NOT_OMITTED
‚ĖĀNOT_OMITTED
NOT_POSITIVE
‚ĖĀNOT_POSITIVE
NOT_ZERO
‚ĖĀNOT_ZERO
NUMERIC
‚ĖĀNUMERIC
NUMERIC_EDITED
‚ĖĀNUMERIC_EDITED
NUMVALC_FUNC
‚ĖĀNUMVALC_FUNC
NaN
‚ĖĀNaN
Name
‚ĖĀName
Nat
‚ĖĀNat
Newline
‚ĖĀNewline
Nmtoken
‚ĖĀNmtoken
NotationDecl
‚ĖĀNotationDecl
NotationType
‚ĖĀNotationType
OBJECT
‚ĖĀOBJECT
OBVIOUS
‚ĖĀOBVIOUS
OMITTED
‚ĖĀOMITTED
ONLY
‚ĖĀONLY
OR
‚ĖĀOR
OR_EQ
‚ĖĀOR_EQ
OR_GE
‚ĖĀOR_GE
OR_GT
‚ĖĀOR_GT
OR_LE
‚ĖĀOR_LE
OR_LT
‚ĖĀOR_LT
OR_NE
‚ĖĀOR_NE
OTHER
‚ĖĀOTHER
OVERLINE
‚ĖĀOVERLINE
PARAGRAPH
‚ĖĀPARAGRAPH
PEDecl
‚ĖĀPEDecl
PERFORM
‚ĖĀPERFORM
PEReference
‚ĖĀPEReference
PI
‚ĖĀPI
PICK
‚ĖĀPICK
PITarget
‚ĖĀPITarget
POSITION
‚ĖĀPOSITION
POSITIVE
‚ĖĀPOSITIVE
PRINTER
‚ĖĀPRINTER
PROCEDURE
‚ĖĀPROCEDURE
PROCEED
‚ĖĀPROCEED
PROGRAM
‚ĖĀPROGRAM
PROOF
‚ĖĀPROOF
PROPOSITION
‚ĖĀPROPOSITION
PROVE
‚ĖĀPROVE
PSL_Actual_Parameter
‚ĖĀPSL_Actual_Parameter
PSL_Any_Type
‚ĖĀPSL_Any_Type
PSL_Assert_Directive
‚ĖĀPSL_Assert_Directive
PSL_Assume_Directive
‚ĖĀPSL_Assume_Directive
PSL_Boolean
‚ĖĀPSL_Boolean
PSL_Braced_SERE
‚ĖĀPSL_Braced_SERE
PSL_Clocked_SERE
‚ĖĀPSL_Clocked_SERE
PSL_Compound_SERE
‚ĖĀPSL_Compound_SERE
PSL_Count
‚ĖĀPSL_Count
PSL_Cover_Directive
‚ĖĀPSL_Cover_Directive
PSL_Expression
‚ĖĀPSL_Expression
PSL_Formal_Parameter
‚ĖĀPSL_Formal_Parameter
PSL_HDL_Type
‚ĖĀPSL_HDL_Type
PSL_Identifier
‚ĖĀPSL_Identifier
PSL_Index_Range
‚ĖĀPSL_Index_Range
PSL_Inherit_Spec
‚ĖĀPSL_Inherit_Spec
PSL_Number
‚ĖĀPSL_Number
PSL_Repeated_SERE
‚ĖĀPSL_Repeated_SERE
PSL_Simple_SERE
‚ĖĀPSL_Simple_SERE
PSL_Type_Class
‚ĖĀPSL_Type_Class
PSL_Union_Expression
‚ĖĀPSL_Union_Expression
PSL_VMode
‚ĖĀPSL_VMode
PSL_VProp
‚ĖĀPSL_VProp
PSL_VUnit
‚ĖĀPSL_VUnit
PSL_Value_Set
‚ĖĀPSL_Value_Set
PUBLIC
‚ĖĀPUBLIC
PseudoAtt
‚ĖĀPseudoAtt
PseudoAttValue
‚ĖĀPseudoAttValue
PubidLiteral
‚ĖĀPubidLiteral
PublicID
‚ĖĀPublicID
QED
‚ĖĀQED
QUERY
‚ĖĀQUERY
QUOTE
‚ĖĀQUOTE
RANDOM
‚ĖĀRANDOM
READ
‚ĖĀREAD
RECORD
‚ĖĀRECORD
RECURSIVE
‚ĖĀRECURSIVE
REEL
‚ĖĀREEL
RELATIVE
‚ĖĀRELATIVE
REMOVAL
‚ĖĀREMOVAL
REVERSE_FUNC
‚ĖĀREVERSE_FUNC
REVERSE_VIDEO
‚ĖĀREVERSE_VIDEO
REWIND
‚ĖĀREWIND
RIGHT
‚ĖĀRIGHT
ROUNDED
‚ĖĀROUNDED
Real
‚ĖĀReal
SCALAR
‚ĖĀSCALAR
SCHEMA
‚ĖĀSCHEMA
SCROLL
‚ĖĀSCROLL
SD
‚ĖĀSD
SECTION
‚ĖĀSECTION
SEL
‚ĖĀSEL
SEQUENTIAL
‚ĖĀSEQUENTIAL
SF_
‚ĖĀSF_
SIGNED
‚ĖĀSIGNED
SIZE
‚ĖĀSIZE
SOURCE
‚ĖĀSOURCE
SPACE
‚ĖĀSPACE
STANDARD
‚ĖĀSTANDARD
STATE
‚ĖĀSTATE
STRING
‚ĖĀSTRING
STag
‚ĖĀSTag
SUBSCRIPTION
‚ĖĀSUBSCRIPTION
SUBSET
‚ĖĀSUBSET
SUBSTITUTE_CASE_FUNC
‚ĖĀSUBSTITUTE_CASE_FUNC
SUBSTITUTE_FUNC
‚ĖĀSUBSTITUTE_FUNC
SUFFICES
‚ĖĀSUFFICES
SYSTEM
‚ĖĀSYSTEM
Stdcall
‚ĖĀStdcall
StringType
‚ĖĀStringType
StyleSheetPI
‚ĖĀStyleSheetPI
SystemLiteral
‚ĖĀSystemLiteral
TAKE
‚ĖĀTAKE
TEMPORAL
‚ĖĀTEMPORAL
THEN
‚ĖĀTHEN
THEOREM
‚ĖĀTHEOREM
THRU
‚ĖĀTHRU
TO
‚ĖĀTO
TOK_NULL
‚ĖĀTOK_NULL
TRIM_FUNCTION
‚ĖĀTRIM_FUNCTION
Thiscall
‚ĖĀThiscall
TokenizedType
‚ĖĀTokenizedType
UL
‚ĖĀUL
UNCHANGED
‚ĖĀUNCHANGED
UNDERLINE
‚ĖĀUNDERLINE
UNION
‚ĖĀUNION
UNIT
‚ĖĀUNIT
UNSIGNED
‚ĖĀUNSIGNED
UP
‚ĖĀUP
UPON
‚ĖĀUPON
UPPER_CASE_FUNC
‚ĖĀUPPER_CASE_FUNC
URI
‚ĖĀURI
USE
‚ĖĀUSE
VARIABLE
‚ĖĀVARIABLE
VARIABLES
‚ĖĀVARIABLES
VARYING
‚ĖĀVARYING
VersionNum
‚ĖĀVersionNum
WF_
‚ĖĀWF_
WHEN_COMPILED_FUNC
‚ĖĀWHEN_COMPILED_FUNC
WITH
‚ĖĀWITH
WITNESS
‚ĖĀWITNESS
WORD
‚ĖĀWORD
WORDS
‚ĖĀWORDS
XMLDecl
‚ĖĀXMLDecl
XmlModelPI
‚ĖĀXmlModelPI
ZERO
‚ĖĀZERO
ZEROS
‚ĖĀZEROS
_2nd_expansion
_ACCEPT
_ADD
_AFTER
_ALPHABET
_ALTERNATE
_ANY
_AS
_AT
_AUTHOR
_Atomic
_AttType
_BEFORE
_BY
_CALL
_CHARACTERS
_CLASS
_CLOSE_NOFEED
_COMMON
_CONFIGURATION
_CONSTANT
_CONTROL
_CONVERTING
_CORE_INDEX
_CRT
_DATA
_DATE_COMPILED
_DATE_WRITTEN
_DEBUGGING
_DECLARATIVES
_DELETE
_DELIMITER
_DISPLAY
_DIVIDE
_DIVISION
_DeclSep
_ELSE
_END
_END_FUNCTION
_END_PROGRAM
_ENTRY
_ENVIRONMENT
_ERROR
_EntityDecl
_EnumeratedType
_Eq
_FILE
_FILE_CONTROL
_FOR
_FORMS_OVERLAY
_FROM
_FUNCTION_ID
_GIVING
_GLOB_STAR
_HASH_PERCENT
_IDENTIFICATION
_IF
_IGNORING
_INITIAL
_INPUT
_INPUT_OUTPUT
_INSTALLATION
_INTO
_INVALID
_IS
_I_O_CONTROL
_KW_FOR
_KW_USE
_LABEL
_LENGTH
_LINKAGE
_LITERAL
_LOCALE
_LOCAL_STORAGE
_LOCK
_MEMORY
_MERGE
_MODE
_MOVE
_MULTIPLY
_NEXT
_NO
_NONASSOC
_NOT
_OBJECT_COMPUTER
_OCCURS
_OF
_ON
_OUTPUT
_PERFORM
_PERLY_BRACE_OPEN
_PERLY_COMMA
_PERLY_HEREDOC
_PERLY_SEMICOLON
_PHASE_NAME
_POINTER
_PROCEDURE
_PROGRAM_ID
_PSL_Boolean
_PSL_Compound_SERE
_PSL_FL_Property
_PSL_Identifier
_PSL_Property
_PSL_Range
_PSL_SERE
_PSL_Sequence
_PSL_Value_Range
_QQSTRING
_READ
_RECORD
_REDEFINES
_RELEASE
_REMAINDER
_RENAMES
_REPORTING
_REPOSITORY
_RETURN
_RETURNING
_REWRITE
_RUN
_Reference
_S
_SCREEN
_SECTION
_SECURITY
_SENTENCE
_SIZE
_SORT
_SOURCE_COMPUTER
_SPECIAL_NAMES
_START
_STATUS
_STOP
_SUBTRACT
_SUB_AMPER
_THRU
_TIMES
_TO
_TRACKS
_UNSIGNED
_UNSTRING
_UNTIL
_UPON_COMMAND_LINE
_VALUE
_VersionInfo
_WHEN
_WITH
_WORD
_WORKING_STORAGE
_WRITE
__asm
__launch_bounds__
__makeref
__reftype
__refvalue
_abstract_literal
_abstract_type
_ac_value_list
_accept_body
_actual_argument
_actual_part
_add_body
_add_op
_after
_alnum_or_id
_alphabet_lits
_annotated_type
_anonymous_dot
_any_argument
_any_prefix_bang
_any_prefix_dot
_any_prefix_tilde
_any_tight_dot
_apostrophe
_argument_item
_argument_type
_arity_value
_array
_array_base_type
_array_pattern_key
_arrow
_arrow_then_type
_as_operator
_aspect_definition
_aspect_mark
_assign_value
_assignment_operator
_association_element
_asy_environment_end
_atom
_att_name_list
_autocmd
_autocmd_pattern
_await_end_tag
_await_start_tag
_b_acr_bgn
_b_als_bgn
_b_blk_seq_spc
_b_flw_map_bgn
_b_flw_seq_bgn
_b_generator_op
_b_sgl_flw_val_blk
_b_sgl_prp
_bang_filter_bangs
_bang_filter_command
_bar
_bare_list_lit
_bare_type
_barestmt
_bareword
_base_method_def
_basic_expression
_basic_value
_begin_proof_step
_bgn_imp_doc
_bin_identifier
_bind_instantiation
_bind_matches
_binding_pattern
_bindpatterns
_bit_expr
_bit_type
_bitshift_operator
_blank
_blank_line
_blk_imp_itm_tal
_block_close
_block_comment_end
_block_comment_start
_block_form
_block_identifier
_block_string_end
_block_string_start
_botright
_br_acr_bgn
_br_als_bgn
_br_blk_map
_br_blk_seq
_br_flw_jsl_ann_par
_br_flw_jsl_val
_br_flw_map_bgn
_br_flw_njl_ann_par
_br_flw_njl_val_flw
_br_flw_seq_bgn
_br_prp
_br_sgl_flw_val_blk
_br_sgl_prp
_brace_end_zw
_bracket_close
_bracket_form
_bracket_open
_browse
_bullet
_c_expression
_c_struct_expression
_c_word
_call_argument_list
